export function cropState () {
    return [
        {
            company: 'ООО "Долгоруково-АгроИнвест"',
            id: 1001,
            region: 1,
            name: "Пшеница",
            sum: [0, 0, 0, 0, 0, 3255, 245, 0],
            step: 0  // состояние культуры с незаданной площадю
        },
        {
            company: 'ООО "Долгоруково-АгроИнвест"',
            id: 1001,
            region: 1,
            name: "Подсолнечник",
            sum: [3200, 720, 0, 0, 0, 0, 0, 3685],
            step: 0
        },
        {
            company: 'ООО "Долгоруково-АгроИнвест"',
            id: 1001,
            region: 1,
            name: "Рапс яровой",
            sum: [0, 0, 0, 1200, 105, 0, 0, 55],
            step: 0
        },

        {
            company: 'ЗАО "Касторное-АгроИнвест"',
            id: 1002,
            region: 1,
            name: "Пшеница",
            sum: [0, 0, 0, 0, 0, 6650, 350, 0],
            step: 0
        },
        {
            company: 'ЗАО "Касторное-АгроИнвест"',
            id: 1002,
            region: 1,
            name: "Подсолнечник",
            sum: [2015, 260, 0, 0, 0, 0, 0, 2050],
            step: 0
        },
        {
            company: 'ЗАО "Касторное-АгроИнвест"',
            id: 1002,
            region: 1,
            name: "Рапс яровой",
            sum: [0, 0, 1000, 200, 0, 0, 0, 0],
            step: 3
        },

        {
            company: 'ООО "АГРОЛИПЕЦК"',
            id: 1003,
            region: 1,
            name: "Пшеница",
            sum: [1470, 280, 0, 0, 0, 0, 0, 0],
            step: 0
        },
        {
            company: 'ООО "АГРОЛИПЕЦК"',
            id: 1003,
            region: 1,
            name: "Подсолнечник",
            sum: [0, 0, 0, 4466, 1160, 0, 0, 504],
            step: 0
        },
        {
            company: 'ООО "АГРОЛИПЕЦК"',
            id: 1003,
            region: 1,
            name: "Рапс яровой",
            sum: [0, 0, 0, 0, 0, 0, 0, 0],
            step: 8
        },
        

        {
            company: 'ЗАО "Дмитриев-Агро-Инвест"',
            id: 1004,
            region: 1,
            name: "Пшеница",
            sum: [3180, 540, 0, 0, 0, 0, 0, 0],
            step: 2860
        },
        {
            company: 'ЗАО "Дмитриев-Агро-Инвест"',            
            id: 1004,
            region: 1,
            name: "Подсолнечник",
            sum: [0, 0, 0, 0, 0, 5162, 638, 0], 
            step: 0
        },
        {
            company: 'ЗАО "Дмитриев-Агро-Инвест"',
            id: 1004,
            region: 1,
            name: "Рапс яровой",
            sum: [890, 110, 0, 0, 0, 0, 0, 0],
            step: 0
        },

        {
            company: 'ООО "Новохоперск-АгроИнвест"',
            id: 2001,
            region: 2,
            name: "Пшеница",
            sum: [0, 0, 0, 0, 0, 1350, 150, 0],
            step: 0  // состояние культуры с незаданной площадю
        },
        {
            company: 'ООО "Новохоперск-АгроИнвест"',
            id: 2001,
            region: 2,
            name: "Подсолнечник",
            sum: [0, 0, 0, 0, 0, 6345, 405, 0],
            step: 0  // состояние культуры с незаданной площадю
        },
        {
            company: 'ООО "Елань-АгроИнвест"',
            id: 2002,
            region: 2,
            name: "Пшеница",
            sum: [800, 300, 0, 0, 0, 0, 0, 1200],
            step: 0  // состояние культуры с незаданной площадю
        },        
        {
            company: 'ООО "Елань-АгроИнвест"',
            id: 2002,
            region: 2,
            name: "Подсолнечник",
            sum: [0, 0, 0, 0, 0, 7470, 530, 0],
            step: 0  // состояние культуры с незаданной площадю
        },        
        {
            company: 'ООО "Городище-АгроИнвест"',
            id: 2003,
            region: 2,
            name: "Пшеница",
            sum: [0, 0, 0, 0, 0, 0, 0, 0],
            step: 2  // состояние культуры с незаданной площадю
        },        
        {
            company: 'ООО "Городище-АгроИнвест"',
            id: 2003,
            region: 2,
            name: "Подсолнечник",
            sum: [5198, 67, 0, 0, 0, 0, 0, 2212],
            step: 0  // состояние культуры с незаданной площадю
        },        
        {
            company: 'ООО "Приволжское-АгроИнвест"',
            id: 2004,
            region: 2,
            name: "Пшеница",
            sum: [1200, 150, 0, 0, 0, 0, 0, 150],
            step: 0  // состояние культуры с незаданной площадю
        },
        {
            company: 'ООО "Приволжское-АгроИнвест"',
            id: 2004,
            region: 2,
            name: "Пшеница",
            sum: [0, 0, 0, 0, 0, 0, 0, 0],
            step: 7  // состояние культуры с незаданной площадю
        },
        {
            company: 'ООО "Даниловка-АгроИнвест"',
            id: 2005,
            region: 2,
            name: "Пшеница",
            sum: [735, 60, 0, 0, 0, 0, 0, 665],
            step: 0  // состояние культуры с незаданной площадю
        },
        {
            company: 'ООО "Даниловка-АгроИнвест"',
            id: 2005,
            region: 2,
            name: "Подсолнечник",
            sum: [0, 0, 0, 0, 0, 0, 0, 0],
            step: 7  // состояние культуры с незаданной площадю
        },

        {
            company: '',
            id: 3001,
            region: 3,
            name: "Пшеница",
            sum: [0, 0, 0, 0, 0, 0, 0, 0],
            step: 0  // состояние культуры с незаданной площадю
        },
        {
            company: '',
            id: 3001,
            region: 3,
            name: "Пшеница",
            sum: [0, 0, 0, 0, 0, 0, 0, 0],
            step: 0  // состояние культуры с незаданной площадю
        },
        {
            company: '',
            id: 3001,
            region: 3,
            name: "Пшеница",
            sum: [0, 0, 0, 0, 0, 0, 0, 0],
            step: 0  // состояние культуры с незаданной площадю
        },
        {
            company: '',
            id: 3001,
            region: 3,
            name: "Пшеница",
            sum: [0, 0, 0, 0, 0, 0, 0, 0],
            step: 0  // состояние культуры с незаданной площадю
        },
        {
            company: '',
            id: 3001,
            region: 3,
            name: "Пшеница",
            sum: [0, 0, 0, 0, 0, 0, 0, 0],
            step: 0  // состояние культуры с незаданной площадю
        },
        {
            company: '',
            id: 3001,
            region: 3,
            name: "Пшеница",
            sum: [0, 0, 0, 0, 0, 0, 0, 0],
            step: 0  // состояние культуры с незаданной площадю
        },
        {
            company: '',
            id: 3001,
            region: 3,
            name: "Пшеница",
            sum: [0, 0, 0, 0, 0, 0, 0, 0],
            step: 0  // состояние культуры с незаданной площадю
        },
        {
            company: '',
            id: 3001,
            region: 3,
            name: "Пшеница",
            sum: [0, 0, 0, 0, 0, 0, 0, 0],
            step: 0  // состояние культуры с незаданной площадю
        },

    ];
    };
    
    export default cropState;