export function cropState () {
    return [
        {
            company: 'ООО "Долгоруково-АгроИнвест"',
            id: 1001,
            region: 1,
            lay: 1,
            
            crops: [
            {
                name: "Пшеница",
                sum: [0, 0, 0, 0, 0, 3255, 245, 0],
            },
            {
                name: "Подсолнечник",
                sum: [3200, 720, 0, 0, 0, 0, 0, 3685],
            },
            {
                name: "Рапс Яровой",
                sum: [0, 0, 0, 1200, 105, 0, 0, 55],
            }
            ]
        },

        {
            company: 'ЗАО "Касторное-АгроИнвест"',
            id: 1002,
            region: 1,
            lay: 1,

            crops: [
            {
                name: "Пшеница",
                sum: [0, 0, 0, 0, 0, 6650, 350, 0],
            },
            {
                name: "Подсолнечник",
                sum: [2015, 260, 0, 0, 0, 0, 0, 2050],
            },
            {
                name: "Рапс Яровой",
                sum: [0, 0, 1000, 200, 0, 0, 0, 0],
            }
            ]
        },

        {
            company: 'ООО "АГРОЛИПЕЦК"',
            id: 1003,
            region: 1,
            lay: 2,

            crops: [
            {
                name: "Подсолнечник",
                sum: [0, 0, 0, 4466, 1160, 0, 0, 504],
            },              
            {
                name: "Пшеница",
                sum: [1470, 280, 0, 0, 0, 0, 0, 1400],
            },
            {
                name: "Рапс Яровой",
                sum: [0, 0, 0, 0, 0, 0, 1, 0],
            }
            ]
        },

        {
            company: 'ЗАО "Дмитриев-Агро-Инвест"',
            id: 1004,
            region: 1,
            lay: 3,

            crops: [
            {
                name: "Пшеница",
                sum: [3180, 540, 0, 0, 0, 0, 0, 2860],
            },
            {
                name: "Подсолнечник",
                sum: [0, 0, 0, 0, 0, 5162, 638, 0], 
            },
            {
                name: "Рапс Яровой",
                sum: [0, 0, 0, 0, 0, 890, 110, 0],
            }
            ]
        },


        {
            company: 'ООО "Новохоперск-АгроИнвест"',
            id: 2001,
            region: 2,
            lay: 6,

            crops: [
            {
                name: "Пшеница",
                sum: [0, 0, 0, 0, 0, 1350, 150, 0],
            },
            {
                name: "Подсолнечник",
                sum: [0, 0, 0, 0, 0, 6345, 405, 0],
            }
            ]
        },
        
        {
            company: 'ООО "Елань-АгроИнвест"',
            id: 2002,
            region: 2,
            lay: 6,

            crops: [
            {
                name: "Пшеница",
                sum: [800, 300, 0, 0, 0, 0, 0, 1200],
            },
            {
                name: "Подсолнечник",
                sum: [0, 0, 0, 0, 0, 7470, 530, 0],
            }
            ]
        },        

        {
            company: 'ООО "Городище-АгроИнвест"',
            id: 2003,
            region: 2,
            lay: 6,

            crops: [
            {
                name: "Пшеница",
                sum: [0, 0, 1, 0, 0, 0, 0, 0],
            },
            {
                name: "Подсолнечник",
                sum: [5198, 67, 0, 0, 0, 0, 0, 2212],
            }
            ]
        },        

        {
            company: 'ООО "Приволжское-АгроИнвест"',
            id: 2004,
            region: 2,
            lay: 6,

            crops: [
            {
                name: "Пшеница",
                sum: [1200, 150, 0, 0, 0, 0, 0, 150],
            },
            {
                name: "Подсолнечник",
                sum: [0, 0, 0, 0, 0, 0, 0, 1],
            }
            ]
        },

        {
            company: 'ООО "Даниловка-АгроИнвест"',
            id: 2005,
            region: 2,
            lay: 6,

            crops: [
            {
                name: "Пшеница",
                sum: [735, 60, 0, 0, 0, 0, 0, 665],
            },
            {
                name: "Подсолнечник",
                sum: [0, 0, 0, 0, 0, 0, 0, 1],
            },
            ]
        },


        {
            company: 'ООО "Данков-АгроИнвест"',
            id: 3001,
            region: 3,
            lay: 3,

            crops: [
            {
                name: "Подсолнечник",
                sum: [0, 0, 0, 0, 0, 0, 0, 1],
            },
            {
                name: "Пшеница",
                sum: [0, 0, 0, 0, 0, 6790, 210, 0],
            },
            {
                name: "Рапс Яровой",
                sum: [0, 0, 1, 0, 0, 0, 0, 0],
            }             
            ]
        },

        {
            company: 'ООО "Сосновка-АГРО-Инвест"',
            id: 3002,
            region: 3,
            lay: 4,
            crops: [
            {
                name: "Пшеница",
                sum: [0, 0, 0, 9250, 1540, 0, 0, 0],
            },
            {
                name: "Подсолнечник",
                sum: [960, 60, 0, 0, 0, 0, 0, 1200],
            },
            {
                name: "Рапс Яровой",
                sum: [0, 0, 0, 1, 0, 0, 0, 0],
            }
            ]
        },

        {
            company: 'ООО "Маршанск-АгроИнвест"',
            id: 3003,
            region: 3,
            lay: 3,
            
            crops: [
            {
                name: "Пшеница",
                sum: [0, 0, 0, 0, 0, 6090, 910, 0],
            },
            {
                name: "Подсолнечник",
                sum: [2100, 180, 0, 0, 0, 0, 0, 800],
            },
            {
                name: "Рапс Яровой",
                sum: [0, 0, 0, 0, 0, 0, 0, 1],
            }
            ]
        },
    ];
    };
    
    export default cropState;