export const cropHead = () => {
    return (
        {
            sum1: "Всего",
            sum2: "Засеяно",
            sum3: `Засеяно не в срок`,
            sum4: `Засеяно сегодня`,
            sum5: "Засеяно сегодня не в срок",
            percent: "Засеяно всего",
        }
    );
};

export const cropHead4 = () => {
    return (
        {
            sum1: "Всего",
            sum2: "Убрано",
            sum3: `Убрано не в срок`,
            sum4: `Убрано сегодня`,
            sum5: "Убрано сегодня не в срок",
            percent: "Убрано всего",
        }
    );
};
